Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་སྨིན་མའི་སྤུ་མཉམ་པ་དང་། སྨིན་མ་སྟུག་པ་དང་། སྨིན་མ་གནག་པ་དང་། སྨིན་མ་རྒྱུན་ཆགས་པ་དང་། སྨིན་མ་རིམ་གྱིས་གཞོལ་བ་དང་། མཁུར་བ་རྒྱས་པ་དང་། མཁུར་བ་མི་མཉམ་པ་མེད་པ་དང་། མཁུར་བ་སྐྱོན་དང་བྲལ་བ་དང་། སྡང་བ་དང་། ཁྲོ་བའི་མདོག་མེད་པ་དང་། ཤིན་ཏུ་རིག་པའི་དབང་པོ་དང་ལྡན་པ་ལགས་སོ།
en: Great King, (70) Prince Sarvārthasiddha has a perfect tuft of hair between his brows. (71) His face and forehead are proportional. (72) His head is large. (73) His hair is black, (74) even, (75) fragrant, (76) soft, (77) well kempt, (78) well arranged, and (79) curly.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་དེ་ནི་མཛོད་སྤུ་ཡོངས་སུ་རྫོགས་པ་དང་ལྡན་པ་དང་། གདོང་དང་དཔྲལ་བ་རྐྱེན་དུ་འབབ་པ་དང་། དབུ་ཡོངས་སུ་རྒྱས་པ་དང་། དབུ་སྐྲ་གནག་པ་དང་། དབུ་སྐྲ་མཉམ་པ་དང་། དབུ་སྐྲ་དྲི་ཞིམ་པ་དང་། དབུ་སྐྲ་མི་བཤོར་བ་དང་། དབུ་སྐྲ་མི་འཛིངས་པ་དང་། དབུ་སྐྲ་བྱིན་གྱིས་ཕྲ་བ་དང་། དབུ་སྐྲ་ལྕང་ལོར་འཁྲིལ་བ་དང་ལྡན་པ་ལགས་སོ།
en: Great King, (80) Prince Sarvārthasiddha has hair that curls into the forms of the endless knot, the mark of auspiciousness, the mark of eternal happiness, and the mark of prosperity.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་དེ་ནི་དབུ་སྐྲ་དཔལ་གྱི་བེའུ་དང་། བཀྲ་ཤིས་དང་། གཡུང་དྲུང་འཁྱིལ་བ་དང་། སྡོང་རིས་ཀྱི་དབྱིབས་ལྟ་བུའི་དབུ་སྐྲ་དང་ལྡན་པའོ།
en: Great King, Prince Sarvārthasiddha has all of these eighty marks.

source: །རྒྱལ་པོ་ཆེན་པོ་འདི་དག་ནི་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པའི་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་སྟེ། དེ་དག་དང་ལྡན་པས་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་ཁབ་ན་བཞུགས་པར་མི་འགྱུར་གྱིས། གདོན་མི་འཚལ་བར་རབ་ཏུ་འབྱུང་བའི་སླད་དུ་མངོན་པར་འབྱུང་བར་འགྱུར་རོ།
en: “Great King, these eighty marks that Prince Sarvārthasiddha bears mean that Prince Sarvārthasiddha will not remain in his home, but will certainly leave the palace in order to live the life of a renunciant.”

source: །དེ་ནས་རྒྱལ་པོ་ཟས་གཙང་མས་དྲང་སྲོང་ཆེན་པོ་ནག་པོ་ལས་གཞོན་ནུའི་ལུང་བསྟན་པ་དེ་ཐོས་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ་རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་སྟན་ལས་ལངས་ཏེ།
en: When King Śuddhodana heard the sage Asita’s prophecy about the prince, he rejoiced and felt satisfied, elated, joyful, and blissful.

source: བྱང་ཆུབ་སེམས་དཔའི་རྐང་པ་གཉིས་ལ་ཕྱག་འཚལ་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ།
en: He rose from his seat, prostrated at the feet of the Bodhisattva, and spoke this verse:

source: །ཁྱོད་ལ་ལྷ་ཀུན་ཕྱག་འཚལ་ཞིང་། །དྲང་སྲོང་རྣམས་ཀྱིས་མཆོད་གྱུར་ཏེ། །འཇིག་རྟེན་ཀུན་གྱི་མཆོད་རྟེན་པས།
en: “All the gods prostrate to you. The sages give you offerings, And the entire world worships you,

source: །བདག་ཀྱང་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: So I will also offer you my homage.”

source: །དགེ་སློང་དག་དེ་ལྟར་རྒྱལ་པོ་ཟས་གཙང་མས་དྲང་སྲོང་ཆེན་པོ་ནག་པོ་དང་། སྣག་གི་ཚ་བོ་མིས་བྱིན་དང་བཅས་ཏེ། ཁ་ཟས་ཚུལ་དང་འདྲ་བས་ཚིམ་པར་བྱས་ནས། གོས་བསྐོན་ཏེ་བསྐོར་བ་བྱས་སོ།
en: And so, monks, King Śuddhodana satisfied the sage Asita and his nephew Naradatta appropriately with a banquet, offered them fine garments, and circumambulated them.

source: །དེ་ནས་དྲང་སྲོང་ཆེན་པོ་ནག་པོ་གནས་དེ་ཉིད་ནས་རྫུ་འཕྲུལ་གྱིས་ནམ་མཁའ་ལས་རང་གི་གནས་ག་ལ་བ་དེར་སོང་ངོ་།
en: Then the great sage Asita returned to his own abode by magically flying through the air.

source: །དེ་ནས་དྲང་སྲོང་ཆེན་པོ་ནག་པོས་བྲམ་ཟེའི་ཁྱེའུ་མིས་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །མིས་བྱིན་ཁྱོད་ཀྱིས་ནམ་སངས་རྒྱས་འཇིག་རྟེན་དུ་བྱུང་ངོ་ཞེས་ཐོས་པ་དེའི་ཚེ།
en: Once there, the great sage Asita told the young priest, “Naradatta, when you hear that a buddha has appeared in this world, you must go immediately to see him and take ordination with that teacher.

source: ཁྱོད་སོང་སྟེ་དེའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ཤིག་དང་། དེ་ནི་ཁྱོད་ཀྱི་ཡུན་རིང་པོའི་དོན་དང་། ཕན་པ་དང་བདེ་བར་འགྱུར་རོ།
en: This will have a long-lasting purpose and bring you benefit and happiness.”

source: ལྷ་ཡི་ཚོགས་རྣམས་ནམ་མཁའི་ངོས་ལ་གནས་ཏེ་སངས་རྒྱས་སྒྲ་སྒྲོག་པ།
en: Seeing the hosts of gods, suspended in space calling out, “Buddha!”

source: །ལྷ་ཡི་དྲང་སྲོང་ནག་པོ་རི་སུལ་གནས་པས་མཐོང་ནས་དགའ་མཆོག་ཐོབ།
en: The divine sage Asita, who lived on the mountain slopes, was filled with joy.

source: །འདི་ན་སྲོག་ཆགས་རྣམས་ཀྱི་དགའ་སྐྱེད་སངས་རྒྱས་ཞེས་བྱའི་ཚིག་འདི་ཅི།
en: “What is this word Buddha, which brings such joy to all beings?

source: །བདག་གི་ལུས་ཀྱང་རབ་སིམ་གྱུར་ཅིང་སེམས་བདེ་མཆོག་ཏུ་ཞི་བར་གྱུར།
en: It fills my body with pleasure, my mind with joy, and brings supreme peace.

source: །ལྷ་འམ་འོན་ཏེ་ལྷ་མིན་ཡང་ན་ནམ་མཁའ་ལྡིང་ངམ་མི་འམ་ཅི།
en: “Is he a god, a demigod, a garuḍa, a kinnara, this Buddha?

source: །སངས་རྒྱས་ཞེས་བྱ་དགའ་དང་མོས་བྱེད་ཚིག་འདི་སྔོན་ཆད་མ་ཐོས་ཅི།
en: That word, which I never heard before, brings joy and trust.”

source: །ལྷ་ཡི་མིག་གིས་ཕྱོགས་བཅུར་རི་དང་ས་དང་རྒྱ་མཚོ་རྣམས་ལ་བལྟས།
en: He looked with divine vision over the ten directions, mountains, earth, and oceans,

source: །ཕྱིས་ཡངས་རི་མཚོ་ལ་རྨད་དུ་བྱུང་བ་རྣམ་པ་སྣ་ཚོགས་མཐོང་།
en: And looking again saw many amazing sights on the earth, mountains, and oceans.

source: །འོད་གསལ་མཛེས་པ་ལུས་ལ་སིམ་བྱེད་འདི་ནི་རབ་ཏུ་བཟང་སྣང་ཞིང་།
en: “This beautiful light glows brilliantly, bringing physical bliss.

source: །ཇི་ལྟར་རི་ཡི་རྩེ་མོ་རྣམས་སུ་བྱི་རུའི་མྱུ་གུ་འཐོན་གྱུར་ལ།
en: As coral shoots spring forth on the mountaintops,

source: །ཤིང་ལྗོན་རྣམས་ཀྱང་མེ་ཏོག་བཟང་རྒྱས་སྣ་ཚོགས་འབྲས་བུས་བརྒྱན་གྱུར་ལས།
en: The trees burst into blossom and are laden with fruits—

source: །སྲིད་པ་གསུམ་དུ་དཀོན་མཆོག་དམ་པ་མྱུར་དུ་འབྱུང་བར་ཤིན་ཏུ་གསལ།
en: It is clear that a sublime jewel will soon appear in the three realms.

source: །ས་འདི་ཐམས་ཅད་མཉམ་ཞིང་དྲི་མེད་ལག་མཐིལ་བཞིན་དུ་སྣང་བ་དང་། །ལྷ་རྣམས་དགའ་ཞིང་ནམ་མཁའི་དཀྱིལ་ན་གོས་ཀྱི་གཡབ་མོ་འབྱིན་གྱུར་ལ།
en: “The earth appears even and stainless like the palm of a hand, The gods joyfully wave banners in midair,

source: །ཀླུ་རྒྱལ་རྒྱ་མཚོའི་གནས་ཀྱི་སྟེང་ན་རིན་ཆེན་རྨད་འབྱུང་འཕྱོ་བ་ལས།
en: Marvelous gems float in the abode of the ocean’s nāga king—

source: །འཛམ་བུའི་གླིང་དུ་རྒྱལ་བའི་དཀོན་མཆོག་ཆོས་ཀྱི་འབྱུང་གནས་ངེས་པར་འབྱུང་།
en: Certainly a victorious jewel, a source of the doctrine, will appear in Jambudvīpa!

source: །ངན་སོང་ཞི་ཞིང་སྡུག་བསྔལ་བྲལ་ཏེ་སེམས་ཅན་རྣམས་ནི་བདེར་ལྡན་ལ།
en: “The lower realms are pacified, suffering removed, and beings find joy,

source: །ལྷ་ཡི་ཚོགས་རྣམས་ནམ་མཁའི་དཀྱིལ་ལ་དགའ་དང་ལྡན་པར་རྒྱུ་བ་དང་། །ཇི་ལྟར་ལྷ་ཡི་གླུ་དབྱངས་སྒྲ་སྙན་ཡིད་དུ་འོང་བ་གྲག་པ་ལས།
en: Hosts of devas move about the sky with delight As the pleasing and melodious songs of the gods resound—

source: །སྲིད་པ་གསུམ་འདིར་དཀོན་མཆོག་འབྱུང་འགྱུར་དེ་ཡི་ལྟས་སུ་གདོན་མི་ཟ།
en: These are certainly signs that here in the three realms, a jewel will appear.”

source: །འཛམ་བུའི་གླིང་འདིར་དྲང་སྲོང་ནག་པོས་ལྷ་ཡི་མིག་གིས་རྣམ་བལྟས་ན།
en: Here in Jambudvīpa, the sage Asita looked with the divine eye

source: །སེར་སྐྱའི་གྲོང་ན་རྒྱལ་པོ་ཟས་གཙང་གྲོང་ཁྱེར་དམ་པ་ཡོད་པ་དེར།
en: To the city of Kapilavastu, King Śuddhodana’s sublime city.

source: །མཐུ་ཆེན་མཐུ་ལྡན་མཚན་དང་བསོད་ནམས་གཟི་བརྗིད་རྒྱས་པ་བཙས་པ་མཐོང་།
en: There he saw a person born who was as strong as Nārāyaṇa, with signs and splendorous merit;

source: །མཐོང་ནས་དགའ་མགུ་རངས་ཤིང་བདེ་བའི་ཡིད་སྐྱེས་མཐུ་ཡང་སྐྱེས་པར་གྱུར།
en: He rejoiced, his mind became joyful, and he gained strength.

source: །དེ་ནས་ངོ་མཚར་རྙེད་དེ་རང་གི་སློབ་མ་ལྷན་ཅིག་རིངས་སུ་དོང་།
en: Amazed, he went quickly with his disciple

source: །ཕྱིན་ནས་སེར་སྐྱར་བརྗོད་པའི་རྒྱལ་པོའི་གྲོང་ཁྱེར་མཆོག་གི་སྒོར་འདུག་སྟེ།
en: And arrived at the gate of Kapilavastu, the king’s supreme city,

source: །ཞབས་འབྲིང་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་མང་པོ་དྲང་སྲོང་དེས་མཐོང་ནས།
en: Where he saw many trillions of living beings thronging.

source: །སྒོ་བ་དེ་ལ་སྨྲས་པ་ཆབ་སྒོར་དྲང་སྲོང་ཕྱིན་ཅེས་མྱུར་དུ་གསོལ།
en: He asked the gatekeeper to quickly say that a sage was at the gate.

source: །དེ་མཉན་མྱུར་དུ་ཕོ་བྲང་ནང་ཕྱིན་རྒྱལ་པོ་ལ་ནི་དེ་བསྙད་པ།
en: The gatekeeper hurriedly entered the palace and told the king,

source: །ལྷ་ཅིག་དྲང་སྲོང་རྒན་འཁོགས་དཀའ་ཐུབ་ཆེན་པོ་ཅན་ཞིག་ཆབ་སྒོར་མཆིས།
en: “Your Majesty, there is an old sage, a great ascetic, at the palace gates;

source: །དྲང་སྲོང་མཆོག་དེ་རྒྱལ་པོའི་ཕོ་བྲང་ནང་དུ་མཆི་བར་དགའ་ཞེས་མཆི།
en: That supreme sage asks to enter the king’s palace.

source: །རྒྱལ་པོ་ཆེན་པོ་ནང་དུ་བཏང་ངམ་མི་བཏང་བདག་ལ་བཀའ་སྩལ་གསོལ།
en: Great King, shall I let him in or not? Please let me know.”

source: །དེ་ནས་དེ་ཡི་སྟན་བཏིང་རྒྱལ་པོས་ཁྱོད་སོང་ནང་དུ་བོས་ཞེས་བསྒོ།
en: The king made a seat for the sage and said, “Go and bring him here.”

source: །དྲང་སྲོང་ནག་པོས་བསྒོ་བའི་ཚིག་ཐོས་དགའ་མགུ་བདེ་དང་ལྡན་པར་གྱུར།
en: When the sage Asita heard the doorman’s words, he was happy and joyful.

source: །སྐོམ་པ་བསིལ་བའི་ཆུ་འདོད་བཀྲེས་པས་གདུངས་པ་ཟས་ལ་མོས་པ་ལྟར།
en: Like a thirsty man wishes for cool water, or one tormented by hunger hopes for food,

source: །དྲང་སྲོང་དམ་པ་དེ་ཡང་སེམས་ཅན་མཆོག་དེ་མཐོང་དུ་མངོན་པར་དགའ།
en: The sublime sage was overjoyed at the prospect of seeing this excellent being.

source: །རྒྱལ་པོ་རྒྱལ་གྱུར་སྐུ་ཚེ་རིང་བསྲུང་གསོལ་ཞེས་དགའ་བས་དེ་སྐད་སྨྲས།
en: He joyously exclaimed, “King, may you be victorious and live long!”

source: །སྙན་པར་བརྗོད་ནས་ཡིད་དུལ་དབང་པོ་ཞི་ཞིང་དེས་པ་སྟན་ལ་འདུག །རྒྱལ་པོས་གུས་པར་སྨྲ་བྱས་དྲང་སྲོང་ཐུབ་པ་དེ་ལ་ཚིག་བརྗོད་པ།
en: With these pleasing words and with calm mind and senses, he took his seat. The king respectfully addressed the sage with these words:

source: །རྒྱལ་པོའི་ཕོ་བྲང་འདིར་བྱོན་རྒྱུ་ཅི་ཐུབ་པས་བདག་ལ་མྱུར་དུ་གསུངས།
en: “Please tell me, sage, why have you come to the royal palace?”

source: །ཁྱོད་ཀྱི་སྲས་བལྟམ་གཟུགས་མཆོག་ཕ་རོལ་ཕྱིན་ཅིང་གཟི་བརྗིད་ཆེ་དང་ལྡན།
en: “A son was born to you, supreme, transcendent, and splendorous,

source: །མཐུ་ཆེན་མཚན་རབ་སུམ་ཅུ་གཉིས་ཀྱིས་ཀུན་ནས་རྒྱན་མངའ་བ།
en: Ornamented by thirty-two excellent signs, and with the power of Nārāyaṇa.

source: །རྒྱལ་པོ་ཁྱོད་སྲས་ཐམས་ཅད་དོན་གྲུབ་དེ་ནི་མཐོང་བར་བདག་དགའ་སྟེ།
en: Your Majesty, I would be delighted to see your son, Sarvārthasiddha;

source: །དེ་སླད་འདིར་མཆིས་རྒྱལ་པོ་བདག་ལ་འཚལ་བ་གཞན་ནི་ཡོད་མ་མཆིས།
en: That is why I have come here, O King. I have no other wish.”

source: །ལེགས་སོ་ལེགས་པར་བྱོན་ཏེ་མཉེལ་ཏམ་མ་མཉེལ་ཁྱོད་མཐོང་བདག་དགའོ།
en: “Excellent, you are welcome. Tired or not, I am delighted to see you.

source: །མཆོག་སྦྱིན་གཞོན་ནུ་དེ་ཉལ་ད་ལྟར་བལྟ་བའི་སྐབས་ནི་མ་མཆིས་ཀྱིས།
en: The Boon-Granting Prince is sleeping, so this is not the time to see him.

source: །རེ་ཞིག་ཡུད་ཙམ་གཞེས་དང་འདིར་ནི་ཟླ་བ་ཉ་བ་དྲི་མེད་པ།
en: Wait a while and you will see the Perfect One,

source: །སྐར་མའི་ཚོགས་ཀྱིས་བརྒྱན་པ་འདྲ་བའི་དྲི་མེད་གཟིགས་པར་འགྱུར།
en: Who is like a stainless full moon adorned with a crown of stars.”

source: །གང་ཚེ་ཁ་ལོ་སྒྱུར་མཆོག་ཟླ་བ་རྒྱས་པའི་འོད་མངའ་དེ་སད་པ།
en: When the Supreme Guide awoke, glowing like the full moon,

source: །དེ་ཚེ་རྒྱལ་པོས་འོད་འབར་གཟུགས་འཆང་ཉི་ལས་འཕགས་འོད་པང་བླངས་ཏེ།
en: The king took that blazing being, whose light outshone the sun, onto his lap.

source: །འདི་ལྟར་དྲང་སྲོང་ལྷ་མིས་མཆོད་པ་གསེར་མཆོག་གཟུགས་ལྡན་ད་གཟིགས་ཤིག །དྲང་སྲོང་ནག་པོས་དེ་ཡི་རྐང་པ་མཛེས་པ་འཁོར་ལོའི་མཚན་ཅན་མཐོང་།
en: “Sage, behold the Golden One, worshiped by gods and humans.” The sage Asita saw his beautiful feet, ornamented by the mark of wheels.

source: །དེ་ནས་ལངས་ཏེ་ཐལ་མོ་སྦྱར་ནས་རྐང་པ་གཉིས་ལ་ཕྱག་འཚལ་ཏེ།
en: Then the sage stood up, joined his palms, and prostrated to the prince’s feet;

source: །བདག་ཉིད་ཆེན་པོ་བསྟན་བཅོས་མཁས་པས་པང་དུ་བླངས་ནས་བསམས་ཤིང་བལྟས།
en: The learned sage held the child and gazed upon him, deep in thought.

source: །དེས་ནི་མཐུ་ཆེན་མཐུ་ལྡན་མཚན་གྱི་མཆོག་གིས་བརྒྱན་པ་མཐོང་གྱུར་ནས།
en: He saw the child with the strength of Nārāyaṇa, ornamented by supreme marks;

source: །མགོ་ལྕོགས་རིག་བྱེད་བསྟན་བཅོས་མཁས་པ་དེས་ནི་དེ་ལ་རྣམ་གཉིས་མཐོང་།
en: Skilled in the Vedas and commentaries, the sage shook his head as he saw two possibilities:

source: །སྟོབས་ལྡན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའམ་སངས་རྒྱས་འཇིག་རྟེན་གཙོ་བོར་འགྱུར།
en: The child would be a powerful universal monarch or a buddha, supreme in the world.

source: །ཤིན་ཏུ་མི་དགའ་ལུས་དང་སེམས་ཀྱིས་མཆི་མ་བླགས་ཏེ་ཤུགས་རིང་ཕྱུང་།
en: Terribly sad in body and mind, the sage shed tears and sighed deeply.

source: །རྒྱལ་པོ་མཆོག་ཀྱང་སྔངས་པར་གྱུར་ནས་བྲམ་ཟེ་ཅི་སླད་བཤུམས་ཞེས་སྨྲ།
en: The supreme king became afraid and asked, “Why does the priest weep?

source: །དྲང་སྲོང་ནག་པོས་བདག་གི་དོན་གྲུབ་བགེགས་ཞིག་མ་གཟིགས་སམ།
en: Does the sage Asita see some obstacle for my Sarvārthasiddha? “O Sage, why do you weep?

source: དྲང་སྲོང་ཅི་སླད་བཤུམས་མཛད་དགེ་སྡིག་གང་གཟིགས་བདག་ལ་མང་བར་གསུངས།
en: Tell me the truth, what good or evil do you see?”

source: །ཁྱོད་སྲས་དོན་ཀུན་གྲུབ་ལ་བར་ཆད་སྡིག་ཏུ་འགྱུར་བ་མ་མཆིས་ཏེ།
en: “There is no misfortune or obstacle for your son, Sarvārthasiddha;

source: །བདག་ལ་བདག་ཉིད་རྒས་ཤིང་འདི་ལྟར་འཁོགས་པར་གྱུར་ཅེས་མྱ་ངན་བགྱིད།
en: I myself am old and infirm, and thus I grieve for myself.

source: །འདི་ནི་སངས་རྒྱས་འཇིག་རྟེན་མཆོག་འགྱུར་ཆོས་ཀྱང་ཡང་དག་སྟོན་པར་འགྱུར།
en: This prince will be a buddha, revered by the world, who will teach the genuine doctrine.

source: །བདག་གིས་དགའ་བ་ཐོབ་པའི་ཡིད་ཀྱིས་མི་མཐོང་ངོ་ཞེས་དེ་སླད་དུ།
en: “And because I will not see this delightful sight, I cry.

source: །འདི་ཡི་སྐུ་ལ་མཚན་རབ་སུམ་ཅུ་རྩ་གཉིས་དྲི་མེད་མངའ་བ་ལས།
en: Your Majesty, his stainless body is marked by thirty-two excellent signs,

source: །རྣམ་པ་གཉིས་སུ་འགྱུར་ཏེ་གསུམ་དུ་མ་མཆིས་རྒྱལ་པོ་མཁྱེན་པར་མཛོད།
en: Thus he has only one of two destinies, and no third choice:

source: །འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་འགྱུར་ཡང་ན་སངས་རྒྱས་འཇིག་རྟེན་གཙོ་བོར་བྱོན།
en: Either he will be a universal monarch, or he will be a buddha, supreme on this earth.

source: །འདི་ནི་འདོད་པའི་ཡོན་ཏན་བཞེད་པར་མི་འགྱུར་ངེས་པར་སངས་རྒྱས་འགྱུར།
en: “Yet, since he will not desire sense pleasures, he will certainly become a buddha.”

source: །དྲང་སྲོང་ལུང་བསྟན་དེ་ཐོས་རྒྱལ་པོ་དགའ་ཞིང་བདེ་བ་ཐོབ་པར་གྱུར།
en: Hearing the sage’s prophecy, the king was delighted and overjoyed;

source: །དེ་ནས་ལངས་ཏེ་ཐལ་མོ་སྦྱར་ནས་རྐང་པ་གཉིས་ལ་ཕྱག་ཀྱང་བྱས།
en: He stood up, joined his palms, and prostrated at the prince’s feet.

source: །སྟོབས་མཆོག་ལྡན་པ་ཁྱོད་ནི་ལྷས་མཆོད་དྲང་སྲོང་རྣམས་ཀྱིས་བསྔགས་པ་སྟེ།
en: “Powerful One, the gods worship you, the sages praise you.

source: །སྲིད་གསུམ་ཀུན་གྱི་འགྲོ་བའི་དེད་དཔོན་མཆོག་གྱུར་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: “Supreme Leader of All Beings in the Three Realms, I prostrate to you!”

source: །དྲང་སྲོང་དགའ་བས་ཚ་བོ་དེ་ལ་སྨྲས་པ་ང་ཡི་གདམས་ངག་ཉོན།
en: The sage was delighted and spoke to his nephew, “Listen to my instructions!

source: །གང་ཚེ་འདི་ནི་བྱང་ཆུབ་སངས་རྒྱས་འགྲོ་ལ་འཁོར་ལོ་སྐོར་ཐོས་པ།
en: When this prince awakens as a buddha and turns the wheel of Dharma,

source: །དེ་ཚེ་མྱུར་དུ་ཐུབ་པའི་བསྟན་ལ་རབ་བྱུང་མྱ་ངན་འདས་པ་འཐོབ།
en: You must immediately take ordination and follow the Able One, and then you shall attain nirvāṇa.”

source: །དྲང་སྲོང་དམ་པ་དེ་ཡིས་རྐང་ལ་ཕྱག་འཚལ་བསྐོར་བ་བྱས་ནས་ནི།
en: The sublime sage prostrated at the prince’s feet, circled him, and told the king,

source: །འདི་འདྲའི་སྲས་མངའ་ཁྱོད་ཀྱི་ཐོབ་པ་རྒྱ་ཆེན་ལེགས་པར་ཐོབ་ཅེས་སྨྲས།
en: “You have very good fortune to have a son like this!

source: །འདི་ནི་འཇིག་རྟེན་ལྷ་དང་མིར་བཅས་ཆོས་ཀྱིས་ཚིམ་པར་མཛད་པར་འགྱུར།
en: He will satisfy the world, with its gods and humans, through the doctrine.”

source: །དྲང་སྲོང་མཆོག་དེ་སེར་སྐྱའི་གནས་ནས་བྱུང་ནས་བདག་གནས་དགོན་པར་ཕྱིན།། །།
en: The great sage then left Kapilavastu and returned to his hermitage.

source: དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བཙས་མ་ཐག་ཏུ་ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོས། གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ལ་བོས་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Monks, as soon as the Bodhisattva was born, the god Maheśvara called out to the gods of the pure abodes,

source: །གྲོགས་པོ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་པར་ཡོངས་སུ་སྦྱང་བ་བྱས་པ། སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། ཐབས་དང་། ཐོས་པ་དང་། སྤྱོད་པ་དང་། བརྟུལ་ཞུགས་དང་། དཀའ་ཐུབ་ཅན་སྤྱད་པ་ལེགས་པར་སྤྱད་པ།
en: “Friends, there is a bodhisattva, a great being, who has excellently and diligently practiced purification, generosity, discipline, patience, diligence, concentration, knowledge, methods, studies, conduct, ascetic practices, and austerities for countless trillions of eons.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་ལྡན་པ་བཏང་སྙོམས་ཀྱིས་ཡང་དག་པར་འཕགས་པའི་བློ་ཅན།
en: He has great love, great compassion, and great joy, and is possessed of a noble mind by virtue of its equanimity.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བརྩོན་པ། བརྩོན་འགྲུས་བརྟན་པའི་གོ་ཆ་ལེགས་པར་བགོས་པ།
en: He strives for the benefit of all beings and is shielded by the armor of diligence.

source: སྔོན་གྱི་རྒྱལ་བ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པས་བྱུང་བ།
en: He has appeared out of the roots of virtue that were brought about by previous buddhas.

source: བསོད་ནམས་བརྒྱ་པའི་མཚན་གྱིས་ཡང་དག་པར་བརྒྱན་པ། རྟུལ་བ་ངེས་པར་བྱས་པ་དང་ལྡན་པ།
en: “He is adorned with the marks of a hundred merits and is full of a determined resolve.

source: ཕ་རོལ་གྱི་དམག་ཚོགས་རབ་ཏུ་འཇོམས་པ། དགའ་བའི་བསམ་པ་ཤིན་ཏུ་དྲི་མ་མེད་པ་ཕུན་སུམ་ཚོགས་པ།
en: He conquers the enemy’s army and has a joyful and excellent mind without stains.

source: ཡེ་ཤེས་ཆེན་པོའི་ཏོག་གི་རྒྱལ་མཚན་ཅན།
en: He bears the crowning banner of great wisdom.

source: །བདུད་ཀྱི་སྟོབས་མཐར་འབྱིན་པ།
en: He uproots the strength of the demons.

source: སྟོང་གསུམ་གྱི་དེད་དཔོན་ཆེན་པོ། ལྷ་དང་མིས་མཆོད་པ།
en: He is the great leader of the trichiliocosm and is worshiped by gods and humans.

source: མཆོད་སྦྱིན་ཆེན་པོའི་མཆོད་སྦྱིན་བྱས་པ། བསོད་ནམས་ཀྱི་ཚོགས་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ།
en: He has performed great sacrifices and possesses an exceedingly excellent accumulation of merit.

source: འབྱུང་བའི་བསམ་པ་ཅན། སྐྱེ་བ་དང་། རྒ་བ་དང་། འཆི་བ་མཐར་འབྱིན་པ།
en: Since he has his mind set on deliverance, he will uproot birth, old age, and death.

source: ལེགས་པར་སྐྱེ་བས་སྐྱེས་པ། འགྲོ་བ་རྣམ་པར་བྱང་ཆུབ་པར་བྱེད་པ་དེ།
en: He is wellborn and will bring beings to awakening.

source: བུ་རམ་ཤིང་པའི་རྒྱལ་པོའི་རིགས་སུ་སྐྱེས་ནས་མིའི་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: Born into the family of King Ikṣvāku, he has come to the world of humans.

source: དེ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱས་ཚུར་ཤོག །བདག་ཅག་དེ་ལ་ཕྱག་འཚལ་ཞིང་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་། མངོན་པར་བསྟོད་པར་བྱ་བའི་ཕྱིར་འདོང་ངོ་།
en: He will soon awaken to unexcelled, perfect, and complete buddhahood. Let us go and pay homage to him, serve him, respect him, and praise him.

source: །ལྷའི་བུ་ང་རྒྱལ་གྱི་ཟིལ་གྱིས་ནོན་པ་གཞན་དག་ཀྱང་བདག་ཅག་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་བ་མཐོང་བ་དང་། དེ་དག་ཀྱང་ང་རྒྱལ་དང་། དྲེགས་པ་དང་། རྒྱགས་པ་གཏོང་བར་འགྱུར་ཏེ།
en: The other gods who are overcome by their pride will see us paying homage to the Bodhisattva, and they will cast aside their pride, haughtiness, and arrogance.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་ཞིང་རིམ་གྲོ་དང་བཀུར་སྟི་བྱེད་པར་བྱ་བའི་ཕྱིར་འདོང་ངོ་།
en: They will also go to pay homage, service, and respect to the Bodhisattva.

source: །དེ་ནི་ལྷའི་བུ་དེ་དག་ལ་ཡུན་རིང་པོའི་དོན་དང་། ཕན་པ་དང་། བདེ་བ་དང་། འཆི་བ་མེད་པ་འཐོབ་པའི་བར་དུ་འགྱུར་རོ།
en: This will bring lasting purpose, benefit, and happiness to those gods, until they attain immortality.

source: །རྒྱལ་པོ་ཟས་གཙང་མ་རྒྱལ་བ་འཕེལ་བ་ཡང་རྗེས་སུ་བསྒྲགས་པར་འགྱུར་རོ།
en: The might and prosperity of King Śuddhodana will become renowned.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཡང་དེ་ཁོ་ནའི་ལུང་བསྟན་པས་ལུང་བསྟན་ཏེ་བདག་ཅག་ཕྱིར་འོང་བར་བྱའོ།
en: Let us make a true prophecy about the Bodhisattva, and then return.”

source: །དེ་སྐད་ཅེས་བསྒོ་ནས་ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ། ལྷའི་བུ་བརྒྱ་སྟོང་ཕྲག་བཅུ་གཉིས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ཐམས་ཅད་འོད་ཀྱིས་རྒྱས་པར་བཀང་སྟེ།
en: After the god Maheśvara had said this, he took off for the palace of King Śuddhodana surrounded by one million two hundred thousand gods, bathing the entire city of Kapilavastu in light.

source: རྒྱལ་པོ་ཟས་གཙང་མའི་ཕོ་བྲང་ག་ལ་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། སྒོ་བས་རྒྱལ་པོ་ལ་གསོལ་ཏེ། རྒྱལ་པོས་གནང་ནས་རྒྱལ་པོའི་ཕོ་བྲང་དུ་ཕྱིན་ཏེ།
en: The gatekeeper informed the king of their arrival, and Maheśvara entered the palace with the king’s permission.

source: བྱང་ཆུབ་སེམས་དཔའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ།
en: He prostrated, touching his head to the Bodhisattva’s feet, drew his robe over one shoulder, and circled the Bodhisattva many hundreds of thousands of times.

source: ལན་བརྒྱ་སྟོང་ཕྲག་དུ་མར་བསྐོར་བ་བྱས་ནས་བྱང་ཆུབ་སེམས་དཔའ་པང་དུ་བླངས་ཏེ་རྒྱལ་པོ་ཟས་གཙང་མ་ལ་དགའ་བར་བྱ་བའི་ཕྱིར་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: He then took the Bodhisattva onto his lap and spoke these joyful words to King Śuddhodana:

source: །རྒྱལ་པོ་ཆེན་པོ་དགྱེས་པའི་དམ་པས་དགྱེས་པར་མཛོད་ཅིག
en: “Great King, you should be supremely delighted!

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྐུ་མཚན་དང་དཔེ་བྱད་བཟང་པོས་ལེགས་པར་བརྒྱན་པ་དང་། གཞོན་ནུས་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཁ་དོག་དང་། གཟི་བརྗིད་དང་། གྲགས་པ་དང་། དཔལ་གྱི་ཟིལ་གྱིས་ནོན་པ་ལས་ན།
en: The reason, Great King, is that the Bodhisattva’s body is beautifully ornamented with the major and minor marks of a great being, and he outshines the world of gods, humans, and demigods with his color, magnificence, renown, and glory.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་གདོན་མི་འཚལ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Great King, it is therefore certain that the Bodhisattva will awaken to unexcelled, perfect, and complete buddhahood.”

source: །དགེ་སློང་དག་དེ་ལྟར་ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་མང་པོ་དང་ལྷན་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་དང་། རིམ་གྲོ་ཆེན་པོ་བྱས་ཏེ།
en: Monks, in this way the god Maheśvara, together with the many gods of the pure realms, made offerings to the Bodhisattva and showed him great respect.

source: དེ་ཁོ་ནའི་ལུང་བསྟན་པས་བྱང་ཆུབ་སེམས་དཔའ་ལུང་བསྟན་ནས་ཕྱིར་བདག་གི་གནས་སུ་སོང་ངོ་།
en: As they had now given the true prophecy, they returned to their own abodes.

source: ཡོན་ཏན་རྒྱ་མཚོའི་ཕ་རོལ་ཕྱིན་པ་དེ་བལྟམ་པ།
en: Learning of the birth of He Who Has Crossed the Ocean of Qualities,

source: །ལྷ་ཡི་དབང་པོས་ཤེས་ནས་དགའ་སྟེ་ལྷ་ལ་སྨྲས།
en: Maheśvara, overjoyed, spoke to the gods,

source: །དེ་ཐོས་འགྱུར་བའང་བསྐལ་པ་བྱེ་མང་ཤིན་ཏུ་དཀའ།
en: “For many millions of eons, it is so rare even to hear of this;

source: །ཚུར་ཤོག་མི་ཡི་དབང་པོ་དེ་ལ་མཆོད་དུ་འདེང་།
en: So come, let us go and worship the Lord of Men.”

source: །རིན་ཆེན་ནོར་བུས་གཙུག་ནི་ལེགས་བརྒྱན་སྤྱོད་ལམ་ལྡན།
en: Thus all the twelve thousand pure gods, beautifully ornamented with jeweled crowns,

source: །གཙུག་པུད་མཛེས་པ་འཕྱང་བ་རྣམ་པར་དག་པའི་ལྷ།
en: Excellently comported, and with their lovely hair flowing,

source: །སྟོང་ཕྲག་བཅུ་གཉིས་ཚང་བ་སེར་སྐྱའི་གནས་མཆོག་ཏུ།
en: Quickly traveled to the supreme city of Kapilavastu

source: །མྱུར་དུ་ལྷགས་ནས་རྒྱལ་པོའི་སྒོ་ཡི་དྲུང་ན་སྡོད།
en: And stood before the king’s gate.

source: །དེ་དག་རྣམས་ཀྱིས་སྒོ་བ་ལ་ནི་ཡིད་འོང་སྨྲས།
en: They spoke politely to the gatekeeper,

source: །རྒྱལ་པོའི་ཕོ་བྲང་སོང་སྟེ་ཐུགས་སུ་ཆུད་པར་གསོལ།
en: “Go to the palace and make our arrival known to the king.”

source: །ཆབ་སྒོ་བས་ཀྱང་ཚིག་དེ་མཉན་ནས་ནང་དུ་སོང་།
en: The gatekeeper went inside as they asked,

source: །ཐལ་མོ་སྦྱར་ནས་རྒྱལ་པོ་དེ་ལ་འདི་སྐད་སྨྲས།
en: Joined his palms, and spoke to the king.

source: །ལྷན་ཅིག་རྟག་ཏུ་རྒྱལ་གྱུར་སྐུ་ཚེ་རིང་དུ་སྲུངས།
en: “Your Majesty, may you always be victorious and live long!

source: །བསོད་ནམས་ཡངས་པ་རྣམ་དག་འོད་ཅན་ཆབ་སྒོར་མཆིས།
en: Pure luminescent beings with great merit stand by your door,

source: །ཟླ་བ་ཉ་ལྟར་བཞིན་བཟང་ཟླ་ལྟར་དྲི་མེད་འོད།
en: Their faces are like the full moon; their luster is pure like that of the clear moon.

source: །རྒྱལ་པོ་དེ་དག་གང་དུ་མཆི་ཡང་གྲིབ་མི་གདའ།
en: “King, wherever they go, they cast no shadow;

source: །སུག་པ་འདོར་ཡང་གོམ་པའི་སྒྲ་དག་ཐོས་མི་འགྱུར།
en: When they walk, their steps make no sound.

source: །དོག་སར་རྒྱུ་བ་བགྱིད་ཀྱང་རྡུལ་ནི་ཡོང་མི་ལྡང་།
en: When they step on the earth, they raise no dust,

source: །སྐྱེ་བོ་རྣམས་ཀྱང་དེ་དག་མཐོང་ན་ངོམས་མི་འགྱུར།
en: And beings never tire of gazing upon them.

source: །དེ་དག་ལུས་ཀྱི་འོད་ནི་ཤིན་ཏུ་རྒྱ་ཆེན་གསལ། །ཚིག་ཀྱང་ཡིད་དུ་མཆིས་ཏེ་མི་ལ་དཔེ་མ་མཆིས།
en: “Their bodies radiate great clear light. Their words are beautiful; those of humans cannot compare!

source: །ཟབ་ཅིང་འཇམ་མཉེན་སྙན་པ་འབྱུང་བའི་གནས།
en: Their speech is profound, soft, and melodious.
